---
title: TableCellStyleOverrideOptions
classe: Autodesk.Revit.DB.TableCellStyleOverrideOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# TableCellStyleOverrideOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean BackgroundColor { get; set; }` | `tableCellStyleOverrideOptions.BackgroundColor` | Boolean |
| `Boolean Bold { get; set; }` | `tableCellStyleOverrideOptions.Bold` | Boolean |
| `Boolean BorderBottomLineStyle { get; set; }` | `tableCellStyleOverrideOptions.BorderBottomLineStyle` | Boolean |
| `Boolean BorderLeftLineStyle { get; set; }` | `tableCellStyleOverrideOptions.BorderLeftLineStyle` | Boolean |
| `Boolean BorderLineStyle { get; set; }` | `tableCellStyleOverrideOptions.BorderLineStyle` | Boolean |
| `Boolean BorderRightLineStyle { get; set; }` | `tableCellStyleOverrideOptions.BorderRightLineStyle` | Boolean |
| `Boolean BorderTopLineStyle { get; set; }` | `tableCellStyleOverrideOptions.BorderTopLineStyle` | Boolean |
| `Boolean Font { get; set; }` | `tableCellStyleOverrideOptions.Font` | Boolean |
| `Boolean FontColor { get; set; }` | `tableCellStyleOverrideOptions.FontColor` | Boolean |
| `Boolean FontSize { get; set; }` | `tableCellStyleOverrideOptions.FontSize` | Boolean |
| `Boolean HorizontalAlignment { get; set; }` | `tableCellStyleOverrideOptions.HorizontalAlignment` | Boolean |
| `Boolean IsValidObject { get; }` | `tableCellStyleOverrideOptions.IsValidObject` | Boolean |
| `Boolean Italics { get; set; }` | `tableCellStyleOverrideOptions.Italics` | Boolean |
| `Boolean TextOrientation { get; set; }` | `tableCellStyleOverrideOptions.TextOrientation` | Boolean |
| `Boolean Underline { get; set; }` | `tableCellStyleOverrideOptions.Underline` | Boolean |
| `Boolean VerticalAlignment { get; set; }` | `tableCellStyleOverrideOptions.VerticalAlignment` | Boolean |
| `Void Dispose()` | `tableCellStyleOverrideOptions.Dispose()` | Void |
| `Void SetAllOverrides(Boolean)` | `tableCellStyleOverrideOptions.SetAllOverrides(bOverride)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```